// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <stdio.h>
#include <inttypes.h>

//#define _CRT_SECURE_NO_WARNINGS

int main()
{
    int8_t n, binary = 0;

    printf("Введите целое отрицательное число\n");
    scanf_s("%d", &n);

    if (n > 0) {
        printf("Число должно быть отрицательным\n");
    }
    else {
        int N = sizeof(n) * 8;
        for (int i = N - 1; i >= 0; i--) {
           
            binary = (n >> i) & 1;

            printf("%d", binary);
        }
    }
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
